src/cf/InformationRegisters/пбп_ИсторияЗагрузкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_ИсторияЗагрузкиФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пбп_ОжиданиеАсинхронныхВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_ОжиданиеАсинхронныхВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИсторияИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СтатусыАсинхронныхВызовов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пбп_СоответствиеОбъектовИнтегрируемыхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_СоответствиеОбъектовИнтегрируемыхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Comment>Номер, код и пр. интегрируемой системы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_ОбъектыИнтегрируемыхСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСистемы</Name>
					<Comment>Уникальный идентификатор (uuid) или значение поля, гарантирующее уникальность записи (например, автоинкремент)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/пбп_СтатусыАсинхронныхВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>пбп_СтатусыАсинхронныхВызовов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяОшибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_ФорматыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_ФорматыИнтеграций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйФормат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BATSH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DLL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/пбп_ИнтеграционныеПотоки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_ИнтеграционныеПотоки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХраненияОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_НаправленияИнтеграционныхПотоков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_НастройкиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьНомераВерсий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_МетодыЗапросаREST</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Comment>0 — порт по умолчанию протокола, иначе 1-65535</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_ТипыJSON</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрURL</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_НастройкиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_НастройкиИнтеграции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяКомпонента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВнешнейКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПользовательскиеФункции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Comment>0 — порт по умолчанию протокола, иначе 1-65535</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_ТипыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ТипыИнтеграций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСУБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_УчетныеЗаписиЭлектроннойПочты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТехническаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВИнтеграционномПотоке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/пбп_ИнтеграцииСервер/Ext/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ПрограммныйИнтерфейс

#Область РаботаСДанными

// Проверяет необходимость использования версионирования объектов обмена
// 
// Возвращаемое значение:
//  Булево - Истина, если версионирование объектов БСП есть и используется
//
Функция ПолучитьИспользованиеВерсионированияОбъектовОбмена() Экспорт
	
	ИмяФункциональнойОпции = "ИспользоватьВерсионированиеОбъектов";
	
	Возврат пбп_Переадресация.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов")
		И ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	
КонецФункции

// Получает предопределенный метод интеграции по идентификатору настройки
//
// Параметры:
//  ИдентификаторНастройки - Строка - идентификатор настройки см. модуль пбп_ПредопределенныеЗначенияПереопределяемый
//  строковый идентификатор предопределенного значения, реквизит ИдентификаторНастройки
//
// Возвращаемое значение:
//  СправочникСсылка.пбп_МетодыИнтеграции - искомый метод интеграции
//
Функция ИнтеграционныйПоток(ИдентификаторНастройки) Экспорт
	Возврат Справочники.пбп_ИнтеграционныеПотоки.НайтиПоРеквизиту("ИдентификаторНастройки", ИдентификаторНастройки);
КонецФункции

// Получает предопределенную интегрируемую систему по идентификатору настройки
//
// Параметры:
//  ИдентификаторНастройки - Строка - идентификатор настройки см. модуль пбп_ПредопределенныеЗначенияПереопределяемый
//  строковый идентификатор предопределенного значения, реквизит ИдентификаторНастройки
//
// Возвращаемое значение:
//  СправочникСсылка.пбп_ИнтегрируемыеСистемы - искомая система интеграции
//
Функция ИнтегрируемаяСистема(ИдентификаторНастройки) Экспорт
	Возврат Справочники.пбп_ИнтегрируемыеСистемы.НайтиПоРеквизиту("ИдентификаторНастройки", ИдентификаторНастройки);
КонецФункции

// Получает предопределенную настройку интеграции по идентификатору настройки
//
// Параметры:
//  ИдентификаторНастройки - Строка - идентификатор настройки см. модуль пбп_ПредопределенныеЗначенияПереопределяемый
//  строковый идентификатор предопределенного значения, реквизит ИдентификаторНастройки
//
// Возвращаемое значение:
//  СправочникСсылка.пбп_НастройкиИнтеграции - искомая настройка интеграции
//
Функция НастройкаИнтеграции(ИдентификаторНастройки) Экспорт
	Возврат Справочники.пбп_НастройкиИнтеграции.НайтиПоРеквизиту("ИдентификаторНастройки", ИдентификаторНастройки);
КонецФункции

#Область ИсторияЗагрузкиФайлов

// Создать или изменить историю загрузки файлов
//
// Параметры:
//  ИнтеграционныйПоток		 - СправочникСсылка.пбп_ИнтеграционныеПотоки - ссылка на поток, в рамках которого загружается файл
//  ИмяФайла				 - Строка - имя загружаемого файла
//  Период					 - Дата - дата загрузки файла сообщения
//  Обработан				 - Булево - статус обработки файла
//
Процедура СоздатьИзменитьИсториюЗагрузкиФайлов(ИнтеграционныйПоток, ИмяФайла, Период = Неопределено, Обработан = Ложь, Изменение = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		ВызватьИсключение НСтр("ru='Не указан интеграционный поток'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ВызватьИсключение НСтр("ru='Не указано имя файла'");
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИнтеграционныйПоток", ИнтеграционныйПоток);
	ПараметрыЗаписи.Вставить("ИмяФайла", ИмяФайла);
	
	Если Не ЗначениеЗаполнено(Период) И Не Изменение Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Обработан <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("Обработан", Обработан);
	КонецЕсли;
	
	Если Изменение Тогда
		РегистрыСведений.пбп_ИсторияЗагрузкиФайлов.ИзменитьЗапись(ПараметрыЗаписи);
	Иначе
		РегистрыСведений.пбп_ИсторияЗагрузкиФайлов.ДобавитьЗапись(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Удалить историю загрузки файлов
//
// Параметры:
//  ИмяФайла				 - Строка - имя загружаемого файла
//  ИнтеграционныйПоток		 - СправочникСсылка.пбп_ИнтеграционныеПотоки - ссылка на поток, в рамках которого загружается файл
//  Период					 - Дата - дата загрузки файла сообщения
//
Процедура УдалитьИсториюЗагрузкиФайлов(ИмяФайла, ИнтеграционныйПоток = Неопределено, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ВызватьИсключение НСтр("ru='Не указано имя файла'");
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИмяФайла", ИмяФайла);
	Если ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		ПараметрыЗаписи.Вставить("ИнтеграционныйПоток", ИнтеграционныйПоток);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыЗаписи.Вставить("Период", Период);
	КонецЕсли;
	
	РегистрыСведений.пбп_ИсторияЗагрузкиФайлов.УдалитьЗаписи(ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти // ИсторияЗагрузкиФайлов

#Область ОжиданиеАсинхронныхВызовов

// Получить ожидание асинхронного вызова для сообщения
//
// Параметры:
//  ИдентификаторСообщения	 - Строка - уникальный идентификатор сообщения обмена
// 
// Возвращаемое значение:
//  Структура - данные с информацией ожидания для сообщения обмена
//
Функция ПолучитьОжиданиеАсинхронногоВызоваДляСообщения(ИдентификаторСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	ДанныеРегистра = РегистрыСведений.пбп_ОжиданиеАсинхронныхВызовов.ПолучитьЗаписи(ИдентификаторСообщения);
	Если Не ЗначениеЗаполнено(ДанныеРегистра) Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Колонки = Новый Массив;
	Для Каждого Колонка Из ДанныеРегистра.Колонки Цикл
		Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	СтруктураДанных = Новый Структура(СтрСоединить(Колонки, ","));
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ДанныеРегистра[0]);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Создать или изменить ожидание асинхронного вызова
//
// Параметры:
//  ИдентификаторСообщения	 - Строка - уникальный идентификатор сообщения обмена
//  Изменение				 - Булево - изменить или создать запись
//  ИсходящееСообщение		 - СправочникСсылка.пбп_ИсторияИнтеграции - история интеграции исх. сообщения
//  Статус					 - ПеречислениеСсылка.пбп_СтатусыАсинхронныхВызовов - статус вызова
//  ДатаВызова				 - Дата - дата вызова
//  ОписаниеОшибки			 - Строка - текст ошибки асинх вызова
//
Процедура СоздатьИзменитьОжиданиеАсинхронногоВызова(ИдентификаторСообщения, ИсходящееСообщение = Неопределено, 
	Статус = Неопределено, ДатаВызова = Неопределено, ОписаниеОшибки = "", Изменение = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Если ЗначениеЗаполнено(ИсходящееСообщение) Тогда
		ПараметрыЗаписи.Вставить("ИсходящееСообщение", ИсходящееСообщение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) И Не Изменение Тогда
		Статус = Перечисления.пбп_СтатусыАсинхронныхВызовов.Отправлен;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) Тогда
		ПараметрыЗаписи.Вставить("Статус", Статус);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВызова) Тогда
		ПараметрыЗаписи.Вставить("ДатаВызова", ДатаВызова);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыЗаписи.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("Пользователь", пбп_Переадресация.АвторизованныйПользователь());
	
	Если Изменение Тогда
		РегистрыСведений.пбп_ОжиданиеАсинхронныхВызовов.ИзменитьЗапись(ПараметрыЗаписи);
	Иначе
		РегистрыСведений.пбп_ОжиданиеАсинхронныхВызовов.ДобавитьЗапись(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Удалить ожидание асинхронного вызова
//
// Параметры:
//  ИдентификаторСообщения	 - Строка	 - идентификатор сообщения обмена
//
Процедура УдалитьОжиданиеАсинхронногоВызова(ИдентификаторСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор сообщения'");
	КонецЕсли;
	
	РегистрыСведений.пбп_ОжиданиеАсинхронныхВызовов.УдалитьЗаписи(ИдентификаторСообщения);
	
КонецПроцедуры

#КонецОбласти // ОжиданиеАсинхронныхВызовов

#Область СоответствиеОбъектовИнтегрируемыхСистем

// Получить ссылки в информационной базе по идентификаторам интегрируемой системы
// См. пбп_ИнтеграцииСлужебный.ПолучитьСсылкиПоИдентификаторамСистем
//
Функция ПолучитьСсылкиПоИдентификаторамСистем(ИнтегрируемаяСистема, МассивИдентификаторов) Экспорт
	
	Возврат пбп_ИнтеграцииСлужебный.ПолучитьСсылкиПоИдентификаторамСистем(
		ИнтегрируемаяСистема, МассивИдентификаторов);
	
КонецФункции

// Получить ссылку на объект по идентификатору системы
// См. пбп_ИнтеграцииСлужебный.ПолучитьСсылкуНаОбъектПоИдентификаторуСистемы
//
Функция ПолучитьСсылкуНаОбъектПоИдентификаторуСистемы(ИнтегрируемаяСистема, Идентификатор) Экспорт
	
	Возврат пбп_ИнтеграцииСлужебный.ПолучитьСсылкуНаОбъектПоИдентификаторуСистемы(
		ИнтегрируемаяСистема, Идентификатор);
	
КонецФункции

// Получить дополнительные идентификаторы из соответствия объектов систем
// См. пбп_ИнтеграцииСлужебный.ПолучитьДополнительныеИдентификаторыИзСоответствияОбъектовСистем
//
Функция ПолучитьДополнительныеИдентификаторыИзСоответствияОбъектовСистем(ИнтегрируемаяСистема, МассивСсылок) Экспорт
	
	Возврат пбп_ИнтеграцииСлужебный.ПолучитьДополнительныеИдентификаторыИзСоответствияОбъектовСистем(
		ИнтегрируемаяСистема, МассивСсылок);
	
КонецФункции

// Создать или изменить соответствие объектов интегрируемых систем
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект информационной базы
//  ИдентификаторСистемы - Строка - идентификатор объекта в интегрируемой системе
//  ДополнительныйИдентификатор - Строка - дополнительный идентификатор (по умолчанию "")
//  Изменение - Булево - изменить существующую запись или создать новую (по умолчанию Ложь)
//
Процедура СоздатьИзменитьСоответствиеОбъектовИнтегрируемыхСистем(ИнтегрируемаяСистема,
	СсылкаНаОбъект, ИдентификаторСистемы, ДополнительныйИдентификатор = "", Изменение = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ВызватьИсключение НСтр("ru='Не указана ссылка на объект'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторСистемы) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор интегрируемой системы'");
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ИнтегрируемаяСистема"	, ИнтегрируемаяСистема);
	ПараметрыЗаписи.Вставить("СсылкаНаОбъект"		, СсылкаНаОбъект);
	ПараметрыЗаписи.Вставить("ИдентификаторСистемы"	, ИдентификаторСистемы);
	
	Если ЗначениеЗаполнено(ДополнительныйИдентификатор) Тогда
		ПараметрыЗаписи.Вставить("ДополнительныйИдентификатор", ДополнительныйИдентификатор);
	КонецЕсли;
	
	Если Изменение Тогда
		РегистрыСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИзменитьЗапись(ПараметрыЗаписи);
	Иначе
		РегистрыСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.ДобавитьЗапись(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

// Удалить соответствие объектов интегрируемых систем
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//  СсылкаНаОбъект - СправочникСсылка - ссылка на объект (необязательно)
//  ИдентификаторСистемы - Строка - идентификатор в системе (необязательно)
//
Процедура УдалитьСоответствиеОбъектовИнтегрируемыхСистем(ИнтегрируемаяСистема, СсылкаНаОбъект = Неопределено, ИдентификаторСистемы = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	ПараметрыУдаления = Новый Структура;
	ПараметрыУдаления.Вставить("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ПараметрыУдаления.Вставить("СсылкаНаОбъект", СсылкаНаОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторСистемы) Тогда
		ПараметрыУдаления.Вставить("ИдентификаторСистемы", ИдентификаторСистемы);
	КонецЕсли;
	
	РегистрыСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.УдалитьЗаписи(ПараметрыУдаления);
	
КонецПроцедуры

#КонецОбласти // СоответствиеОбъектовИнтегрируемыхСистем

#КонецОбласти // РаботаСДанными

#Область ОбщегоНазначения

// Функция форматирует XML запрос в строковом виде для удобного чтения
//
// Параметры:
//	XMLТекст - Строка - XML запрос в строковом виде
//	ИспользоватьОтступы - Булево - по-умолчанию Ложь
// Возвращаемое значение:
//	Строка
Функция ОтформатироватьXMLЧерезDOM(XMLТекст, ИспользоватьОтступы = Ложь) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLТекст);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(Новый ПараметрыЗаписиXML(,, ИспользоватьОтступы, ИспользоватьОтступы));
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Функция возвращает строку, закодированную в base64.
// 
// Параметры:
//  ПодготовленнаяСтрока - Строка - Исходная строка, которую необходимо конвертировать в Base64
//  КодировкаТекста - Строка - Кодировка текста
// 
// Возвращаемое значение:
//  Строка - Зашифрованная строка в Base64
//
Функция ЗашифроватьBase64Сервер(ПодготовленнаяСтрока, КодировкаТекста = "UTF-8") Экспорт
	
	ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ПодготовленнаяСтрока, КодировкаТекста);
	Base64Hash = ПолучитьBase64СтрокуИзДвоичныхДанных(ДвоичныеДанныеСтроки);
	
	Возврат Base64Hash;

КонецФункции

// Получает дату из UnixTime
//
// Параметры:
//  Секунд - Число - значение секунд в UnixTime
// 
// Возвращаемое значение:
//  Строка - строковое представление даты, полученное из UnixTime
//
Функция ДатаИзUnixTime(Знач Секунд) Экспорт
	
	Если Не ЗначениеЗаполнено(Секунд) Тогда
		Возврат '0001.01.01';
	ИначеЕсли ТипЗнч(Секунд) = Тип("Строка") Тогда
		Секунд = Число(Секунд);
	КонецЕсли;
	
	Дата = '1970.01.01' + Секунд;
	
	Возврат Дата;
	
КонецФункции

// Получить подробное представление ошибки исключения
//
// Параметры:
//  ЗаголовокОшибки		 - Строка - заголовок ошибки
//  ИнформацияОбОшибке	 - ИнформацияОбОшибке - информация об ошибке, полученная в исключении
// 
// Возвращаемое значение:
//  Строка - полное описание ошибки
//
Функция ПолучитьПодробноеПредставлениеОшибкиИсключения(ЗаголовокОшибки, ИнформацияОбОшибке) Экспорт
	
	ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ПодробноеПредставление = СтрЗаменить(ПодробноеПредставление, "'", "");
	
	ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки, ПодробноеПредставление);
	
	Возврат НСтр(ПолноеОписаниеОшибки);
	
КонецФункции

#КонецОбласти // ОбщегоНазначения

#Область МетодыИнтеграцийПоТипам

#Область Файловые

// Записать историю интеграции для пользовательской функции для контекста 
//
// Параметры:
//  ПараметрыЗаписи - Структура - параметры записи истории по пользовательской функции. Ключи:
//    ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//    ОбъектыИнтеграции - ТаблицаЗначений - см. пбп_ИнтеграцииСлужебный.ИнициализироватьТаблицуОбъектовИнтеграции
//    ОписаниеОшибки - Строка - ошибка обмена
//    ПолныйПутьКФайлу - Строка - полный путь к файлу обмена
//    ДатаНачалаИнтеграции - Дата - дата начала интеграции
//
Процедура ЗаписатьИсториюИнтеграцииДляПользовательскойФункции(ПараметрыЗаписи) Экспорт
	
	СтруктураЗаписиИстории = пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруЗаписиИстории();
	
	СтруктураЗаписиИстории.ИнтеграционныйПоток	= ПараметрыЗаписи.ИнтеграционныйПоток;
	СтруктураЗаписиИстории.ИнтегрируемаяСистема	= ПараметрыЗаписи.ИнтеграционныйПоток.НастройкаИнтеграции.ИнтегрируемаяСистема;
	СтруктураЗаписиИстории.ОписаниеОшибки		= ПараметрыЗаписи.ОписаниеОшибки;
	СтруктураЗаписиИстории.ГенерироватьПротокол	= Истина;
	
	Если Не ПустаяСтрока(ПараметрыЗаписи.ПолныйПутьКФайлу) Тогда
		ПараметрыФайла = пбп_ПереадресацияКлиентСервер.РазложитьПолноеИмяФайла(ПараметрыЗаписи.ПолныйПутьКФайлу, Ложь);
		
		ПеречислениеМетаданные = Метаданные.Перечисления.пбп_ФорматыИнтеграций;
		Если ПеречислениеМетаданные.ЗначенияПеречисления.Найти(ПараметрыФайла.Расширение) <> Неопределено Тогда
			СтруктураЗаписиИстории.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций[ПараметрыФайла.Расширение];
		Иначе
			СтруктураЗаписиИстории.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.ПроизвольныйФормат;
		КонецЕсли;
		СтруктураЗаписиИстории.ИмяФайлаСообщения = ПараметрыФайла.Имя;
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ПараметрыЗаписи.ПолныйПутьКФайлу);
		СтруктураЗаписиИстории.ФайлСообщения = Новый ХранилищеЗначения(ДвоичныеДанныеФайла);
	КонецЕсли;
	
	Для Каждого СтрокаОбъекта Из ПараметрыЗаписи.ОбъектыИнтеграции Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаписиИстории.ОбъектыИнтеграции.Добавить(), СтрокаОбъекта);
	КонецЦикла;
	
	пбп_ИнтеграцииСлужебный.СоздатьСообщениеИсторииИнтеграции(СтруктураЗаписиИстории);
	
КонецПроцедуры

#КонецОбласти // Файловые

#Область ПрямоеПодключениеКБД

// Установить соединение с внешнем источником данных по настройке интеграции
//
// Параметры:
//  НастройкаИнтеграции - СправочникСсылка.пбп_НастройкиИнтеграции - настройки подключения к базе данных
//
Процедура УстановитьСоединениеСВнешнимИсточникомДанныхПоНастройкеИнтеграции(НастройкаИнтеграции) Экспорт
	
	СтруктураНастроек = пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруНастроекИнтеграции(НастройкаИнтеграции);
	ИмяВнешнегоИсточникаДанных = СтруктураНастроек.ИмяОбъекта;
	
	ПараметрыСоединения = ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].ПолучитьОбщиеПараметрыСоединения();
	ПараметрыСоединения.АутентификацияОС = Ложь;
	ПараметрыСоединения.АутентификацияСтандартная = Истина;
	ПараметрыСоединения.СтрокаСоединения = СтруктураНастроек.СтрокаПодключения;
	ПараметрыСоединения.СУБД = СтруктураНастроек.ТипСУБД;
	
	Если СтруктураНастроек.Свойство("Логин") Тогда
		ПараметрыСоединения.ИмяПользователя = СтруктураНастроек.Логин.Значение;
	Иначе
		ПараметрыСоединения.ИмяПользователя = "";
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("Пароль") Тогда
		ПараметрыСоединения.Пароль = СтруктураНастроек.Пароль.Значение;
	Иначе
		ПараметрыСоединения.Пароль = "";
	КонецЕсли;
	
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьОбщиеПараметрыСоединения(ПараметрыСоединения);
	
	ПользовательСсылка = пбп_Переадресация.ТекущийПользователь();
	ТекущийПользователь = пбп_Переадресация.НайтиПоСсылке(ПользовательСсылка);
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьПараметрыСоединенияПользователя(
		ТекущийПользователь.Имя, ПараметрыСоединения);
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьПараметрыСоединенияСеанса(ПараметрыСоединения);
	
	ВнешниеИсточникиДанных[ИмяВнешнегоИсточникаДанных].УстановитьСоединение();
	
КонецПроцедуры

// Возвращает пустую таблицу параметров запроса внешнего источника
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с инициализированными колонками, подготовленная под заполнение параметров запроса
//
Функция ИнициализироватьТаблицуПараметровЗапросаВнешнегоИсточника() Экспорт
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("НаименованиеПоля");
	ТаблицаПараметров.Колонки.Добавить("Оператор");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	Возврат ТаблицаПараметров;
	
КонецФункции

// Получает таблицу данных из внешнего источника посредством выполнения запроса по условиям
//
// Параметры:
//  ИнтеграционныйПоток		 - СправочникСсылка.пбп_ИнтеграционныеПотоки - ссылка на интеграционный поток
//  ПоляЗапроса				 - Строка - название полей таблицы, перечисленных через запятую
//  ПараметрыЗапроса		 - ТаблицаЗначения - колонками являются наименование поля запроса, по которому необходимо
//  установить условие, значение параметра запроса и оператор сравнения
//  КоличествоПервых		 - Число - количество первых строк выборки. Если не заполнено, то условия по ПЕРВЫЕ нет
//  СтруктураИстории		 - Структура - см. ПолучитьСтруктуруЗаписиИстории
//  СтруктураУпорядочивания	 - Структура - ключом является поле, по которому необходимо упорядочить, 
//  значением является вид сортировки
// 
// Возвращаемое значение:
//  Строка, ТаблицаЗначений - таблица значений с данными, полученными из внешнего источника,
//  с типизированными колонками или строка с ошибкой
//
Функция ПолучитьТаблицуДанныхИзВнешнегоИсточникаПоУсловиям(ИнтеграционныйПоток,
	ПоляЗапроса = "", ПараметрыЗапроса = Неопределено, КоличествоПервых = 0,
	СтруктураИстории = Неопределено, СтруктураУпорядочивания = Неопределено) Экспорт
	
	ЗаголовокОшибки = "Данные не были получены из внешнего источника данных";
	СообщениеОбОшибке = "";
	
	РеквизитыОбъекта = пбп_Переадресация.ЗначенияРеквизитовОбъекта(
		ИнтеграционныйПоток, "НастройкаИнтеграции.ИмяОбъекта, ТочкаВхода");
		
	Если Не ЗначениеЗаполнено(РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта) Тогда
		ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки,
			"в настройках интеграции не заполнено наименование внешнего источника данных");
		СообщениеОбОшибке = НСтр(ПолноеОписаниеОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РеквизитыОбъекта.ТочкаВхода) Тогда
		ПолноеОписаниеОшибки = СтрШаблон("ru = '%1. Подробно: %2';", ЗаголовокОшибки,
			"в интеграционном потоке не заполнено имя таблицы внешнего источника данных");
		СообщениеОбОшибке = НСтр(ПолноеОписаниеОшибки);
	КонецЕсли;
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
		Возврат СообщениеОбОшибке;
	КонецЕсли;
	
	Попытка
		ТаблицаВыборки = ИнициализироватьТаблицуЗначенийИзТаблицыВнешнегоИсточника(
			РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта, РеквизитыОбъекта.ТочкаВхода, ПоляЗапроса);

		Запрос = Новый Запрос;

		ТекстЗапроса = "ВЫБРАТЬ
		|	&ПоляЗапроса
		|ИЗ
		|	ВнешнийИсточникДанных." + РеквизитыОбъекта.НастройкаИнтеграцииИмяОбъекта
			+ ".Таблица." + РеквизитыОбъекта.ТочкаВхода + " КАК Таблица";

		Если Не ПустаяСтрока(ПоляЗапроса) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапроса", ПоляЗапроса);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапроса", "Таблица.*");
		КонецЕсли;

		УсловияЗапроса = "";
		
		// Установка предопределенных параметров запроса из интеграционного потока
		Для Каждого СтрокаПредопределенногоПараметра Из ИнтеграционныйПоток.ПараметрыВхода Цикл
			НуженПеренос = ?(ПустаяСтрока(УсловияЗапроса), "", "
			|	И ");
			УсловияЗапроса = УсловияЗапроса + СтрШаблон("%1Таблица.%2 = &%2",
				НуженПеренос, СтрокаПредопределенногоПараметра.Имя);
			
			Запрос.УстановитьПараметр(
				СтрокаПредопределенногоПараметра.Имя,
				СтрокаПредопределенногоПараметра.ЗначениеПоУмолчанию);
		КонецЦикла;
		
		// Установка опциональных параметров запроса
		Для Каждого КлючЗначениеОператор Из ПараметрыЗапроса Цикл
			НуженПеренос = ?(ПустаяСтрока(УсловияЗапроса), "", "
				|	И ");
			НужныСкобки = ТипЗнч(КлючЗначениеОператор.Значение) = Тип("Массив");
			Скообка1 = ?(НужныСкобки, "(", "");
			Скообка2 = ?(НужныСкобки, ")", "");
			УсловияЗапроса = УсловияЗапроса + СтрШаблон("%1Таблица.%2 %3 %4&%2%5",
				НуженПеренос, КлючЗначениеОператор.НаименованиеПоля, КлючЗначениеОператор.Оператор,
				Скообка1, Скообка2);
			
			Запрос.УстановитьПараметр(КлючЗначениеОператор.НаименованиеПоля, КлючЗначениеОператор.Значение);
		КонецЦикла;
		
		Если Не ПустаяСтрока(УсловияЗапроса) Тогда
			ТекстЗапроса = пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(ТекстЗапроса, УсловияЗапроса);
		КонецЕсли;
		
		Если КоличествоПервых <> 0 Тогда
			ТекстЗапроса = пбп_СхемыЗапросов.УстановитьКоличествоПолучаемыхЗаписей(ТекстЗапроса, КоличествоПервых);
		КонецЕсли;
		
		Если СтруктураУпорядочивания <> Неопределено Тогда
			ДопустимыеНаправления = Новый Массив;
			ДопустимыеНаправления.Добавить("ВОЗР");
			ДопустимыеНаправления.Добавить("УБЫВ");
			
			ПорядокЗапроса = "";
			МассивПорядка = Новый Массив;
			
			Для Каждого КлючЗначениеПорядка Из СтруктураУпорядочивания Цикл
				Если ДопустимыеНаправления.Найти(ВРег(КлючЗначениеПорядка.Значение)) = Неопределено Тогда
					ВызватьИсключение СтрШаблон(
						"Недопустимое направление сортировки: %1. Допустимые значения: ВОЗР, УБЫВ",
						КлючЗначениеПорядка.Значение
					);
				КонецЕсли;
				
				ИмяПараметра = "П_" + КлючЗначениеПорядка.Ключ;
				Запрос.УстановитьПараметр(ИмяПараметра, КлючЗначениеПорядка.Ключ);
				СтрокаПорядка = СтрШаблон("Таблица.&%1 %2", 
					ИмяПараметра, КлючЗначениеПорядка.Значение);
				МассивПорядка.Добавить(СтрокаПорядка);
			КонецЦикла;
			
			ПорядокЗапроса = СтрСоединить(МассивПорядка, ",
			|	");
			
			ТекстЗапроса = ТекстЗапроса + "
			|УПОРЯДОЧИТЬ ПО
			|	" + ПорядокЗапроса;
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Если СтруктураИстории <> Неопределено Тогда
			СтруктураИстории.ИсходящееСообщение = пбп_ИнтеграцииСлужебный
				.ПолучитьПредставлениеТекстЗапросаВнешнегоИсточникаДанных(Запрос);
			НачалоВызова = ТекущаяДатаСеанса();
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если СтруктураИстории <> Неопределено Тогда
			СтруктураИстории.ДлительностьВызова = ТекущаяДатаСеанса() - НачалоВызова;
		КонецЕсли;
		
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаВыборки.Добавить(), ВыборкаРезультатаЗапроса);
		КонецЦикла;
		
		Возврат ТаблицаВыборки;
	Исключение
		СообщениеОбОшибке = ПолучитьПодробноеПредставлениеОшибкиИсключения(ЗаголовокОшибки, ИнформацияОбОшибке());
	КонецПопытки;

	Возврат СообщениеОбОшибке;
	
КонецФункции

// Возвращает инициализированную таблицу значений из таблицы внешнего
// источника по метаданным с типизированными колонками
//
// Параметры:
//  ИмяВнешнегоИсточника - Строка - имя внешнего источника данных
//  ИмяТаблицы			 - Строка - имя таблицы внешнего источника данных
//  НеобходимыеПоля		 - Строка - название полей таблицы, перечисленных через запятую
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пустая таблица значений с типизированными колонками
//
Функция ИнициализироватьТаблицуЗначенийИзТаблицыВнешнегоИсточника(
	ИмяВнешнегоИсточника, ИмяТаблицы, НеобходимыеПоля = "") Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	МетаданныеИсточника = Метаданные.ВнешниеИсточникиДанных[ИмяВнешнегоИсточника];
	МетаданныеТаблицы = МетаданныеИсточника.Таблицы[ИмяТаблицы];
	
	МассивНужныхПолей = Новый Массив;
	Если Не ПустаяСтрока(НеобходимыеПоля) Тогда
		МассивНужныхПолей = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			НеобходимыеПоля, ",", Истина, Истина);
	КонецЕсли;
	
	КоличествоНужныхПолей = МассивНужныхПолей.Количество();
	Для Каждого ПолеТаблицы Из МетаданныеТаблицы.Поля Цикл
		Если КоличествоНужныхПолей <> 0 И МассивНужныхПолей.Найти(ПолеТаблицы.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДанных.Колонки.Добавить(ПолеТаблицы.Имя, ПолеТаблицы.Тип);
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти // ПрямоеПодключениеКБД

#Область REST

// Конвертирует тело HTTP-запроса из соответствия в строку
//
// Параметры:
//  ТелоЗапросаJSON - Структура, Соответствие - данные тела запроса
// 
// Возвращаемое значение:
//  Строка - тело HTTP-запроса
//
Функция ПолучитьЗапросТекстомИзСоответствияJSON(ТелоЗапросаJSON) Экспорт
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапросаJSON, НастройкиСериализации);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

// Возвращает таблицу кодов ответа HTTP
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными соответствия кода значений HTTP и его описанием
//
Функция ПодготовитьТаблицуКодовОтветаHTTP() Экспорт
	
	РазрядностьКодОтвета = 3;
	ДлинаСтрокиОписания = 150;
	
	ТаблицаКодовОтвета = Новый ТаблицаЗначений;
	ТаблицаКодовОтвета.Колонки.Добавить("КодОтвета"			, пбп_Переадресация.ОписаниеТипаЧисло(РазрядностьКодОтвета));
	ТаблицаКодовОтвета.Колонки.Добавить("КраткоеОписание"	, пбп_Переадресация.ОписаниеТипаСтрока(ДлинаСтрокиОписания));
	
	// Успешные
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 100;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 200;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	// Сообщения о перенаправлениях
	Для Инкремент = 0 По 8 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		НоваяСтрока.КодОтвета = Число("30" + Инкремент);
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	// Клиентские
	Для Инкремент = 0 По 17 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		Если Инкремент < 10 Тогда
			НоваяСтрока.КодОтвета = Число("40" + Инкремент);
		Иначе
			НоваяСтрока.КодОтвета = Число("4" + Инкремент);
		КонецЕсли;
		
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	НоваяСтрока = ТаблицаКодовОтвета.Добавить();
	НоваяСтрока.КодОтвета		= 429;
	НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	
	// Серверные
	Для Инкремент = 0 По 11 Цикл
		НоваяСтрока = ТаблицаКодовОтвета.Добавить();
		
		Если Инкремент < 10 Тогда
			НоваяСтрока.КодОтвета = Число("50" + Инкремент);
		Иначе
			НоваяСтрока.КодОтвета = Число("5" + Инкремент);
		КонецЕсли;
		
		НоваяСтрока.КраткоеОписание	= РасшифровкаКодаСостоянияHTTP(НоваяСтрока.КодОтвета);
	КонецЦикла;
	
	Возврат ТаблицаКодовОтвета;
	
КонецФункции

// Функция возвращает расшифровку под коду состояния HTTP-ответа
//
// Параметры:
//  КодСостояния - Число - код состояния HTTP-ответа
// 
// Возвращаемое значение:
//   - Строка - Расшифровка кода
//
Функция РасшифровкаКодаСостоянияHTTP(КодСостояния) Экспорт
	
	Если 100 <= КодСостояния И КодСостояния <= 299 Тогда
		Расшифровка = НСтр("ru = 'Успешно.'");
	ИначеЕсли КодСостояния = 300 Тогда // Multiple Choice
		Расшифровка = НСтр("ru = 'Запрос имеет более чем один из возможных ответов.'");
	ИначеЕсли КодСостояния = 301 Тогда // Moved Permanently
		Расшифровка = НСтр("ru = 'URI запрашиваемого ресурса был изменён.'");
	ИначеЕсли КодСостояния = 302 Тогда // Found
		Расшифровка = НСтр("ru = 'Запрошенный ресурс временно изменён.'");
	ИначеЕсли КодСостояния = 303 Тогда // See Other
		Расшифровка = НСтр("ru = 'Попробуйте получить запрашиваемый ресурс в другой URI с запросом GET.'");
	ИначеЕсли КодСостояния = 304 Тогда // Not Modified
		Расшифровка = НСтр("ru = 'Нет необходимости повторно передавать запрошенные ресурсы.'");
	ИначеЕсли КодСостояния = 305 Тогда // Use Proxy
		Расшифровка = НСтр("ru = 'Запрошенный ресурс должен быть доступен через прокси.'");
	ИначеЕсли КодСостояния = 306 Тогда // Switch Proxy
		Расшифровка = НСтр("ru = 'Последующие запросы должны использовать указанный прокси.'");
	ИначеЕсли КодСостояния = 307 Тогда // Temporary Redirect
		Расшифровка = НСтр("ru = 'Запрошенный ресурс временно перенаправлен на другой URL-адрес с тем же методом, который использовал предыдущий запрос.'");
	ИначеЕсли КодСостояния = 308 Тогда // Permanent Redirect
		Расшифровка = НСтр("ru = 'Запрошенный ресурс теперь постоянно находится в другом URI.'");
	ИначеЕсли КодСостояния = 400 Тогда // Bad Request
		Расшифровка = НСтр("ru = 'Запрос не может быть исполнен.'");
	ИначеЕсли КодСостояния = 401 Тогда // Unauthorized
		Расшифровка = НСтр("ru = 'Попытка авторизации на сервере была отклонена.'");
	ИначеЕсли КодСостояния = 402 Тогда // Payment Required
		Расшифровка = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли КодСостояния = 403 Тогда // Forbidden
		Расшифровка = НСтр("ru = 'К запрашиваемому ресурсу нет доступа.'");
	ИначеЕсли КодСостояния = 404 Тогда // Not Found
		Расшифровка = НСтр("ru = 'Запрашиваемый ресурс не существует на сервере.'");
	ИначеЕсли КодСостояния = 405 Тогда // Method Not Allowed
		Расшифровка = НСтр("ru = 'Метод запроса не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 406 Тогда // Not Acceptable
		Расшифровка = НСтр("ru = 'Запрошенный формат данных не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 407 Тогда // Proxy Authentication Required
		Расшифровка = НСтр("ru = 'Ошибка аутентификации на прокси-сервере'");
	ИначеЕсли КодСостояния = 408 Тогда // Request Timeout
		Расшифровка = НСтр("ru = 'Время ожидания сервером передачи от клиента истекло.'");
	ИначеЕсли КодСостояния = 409 Тогда // Conflict
		Расшифровка = НСтр("ru = 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу.'");
	ИначеЕсли КодСостояния = 410 Тогда // Gone
		Расшифровка = НСтр("ru = 'Ресурс на сервере был перемещен.'");
	ИначеЕсли КодСостояния = 411 Тогда // Length Required
		Расшифровка = НСтр("ru = 'Сервер требует указание ""Content-length."" в заголовке запроса.'");
	ИначеЕсли КодСостояния = 412 Тогда // Precondition Failed
		Расшифровка = НСтр("ru = 'Запрос не применим к ресурсу'");
	ИначеЕсли КодСостояния = 413 Тогда // Request Entity Too Large
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком большой объем передаваемых данных.'");
	ИначеЕсли КодСостояния = 414 Тогда // Request-URL Too Long
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком длинный URL.'");
	ИначеЕсли КодСостояния = 415 Тогда // Unsupported Media-Type
		Расшифровка = НСтр("ru = 'Сервер заметил, что часть запроса была сделана в неподдерживаемом формат'");
	ИначеЕсли КодСостояния = 416 Тогда // Requested Range Not Satisfiable
		Расшифровка = НСтр("ru = 'Часть запрашиваемого ресурса не может быть предоставлена'");
	ИначеЕсли КодСостояния = 417 Тогда // Expectation Failed
		Расшифровка = НСтр("ru = 'Сервер не может предоставить ответ на указанный запрос.'");
	ИначеЕсли КодСостояния = 429 Тогда // Too Many Requests
		Расшифровка = НСтр("ru = 'Слишком много запросов за короткое время.'");
	ИначеЕсли КодСостояния = 500 Тогда // Internal Server Error
		Расшифровка = НСтр("ru = 'Внутренняя ошибка сервера.'");
	ИначеЕсли КодСостояния = 501 Тогда // Not Implemented
		Расшифровка = НСтр("ru = 'Сервер не поддерживает метод запроса.'");
	ИначеЕсли КодСостояния = 502 Тогда // Bad Gateway
		Расшифровка = НСтр("ru = 'Сервер, выступая в роли шлюза или прокси-сервера, 
		                         |получил недействительное ответное сообщение от вышестоящего сервера.'");
	ИначеЕсли КодСостояния = 503 Тогда // Server Unavailable
		Расшифровка = НСтр("ru = 'Сервер временно не доступен.'");
	ИначеЕсли КодСостояния = 504 Тогда // Gateway Timeout
		Расшифровка = НСтр("ru = 'Сервер в роли шлюза или прокси-сервера 
		                         |не дождался ответа от вышестоящего сервера для завершения текущего запроса.'");
	ИначеЕсли КодСостояния = 505 Тогда // HTTP Version Not Supported
		Расшифровка = НСтр("ru = 'Сервер не поддерживает указанную в запросе версию протокола HTTP'");
	ИначеЕсли КодСостояния = 506 Тогда // Variant Also Negotiates
		Расшифровка = НСтр("ru = 'Сервер настроен некорректно, и не способен обработать запрос.'");
	ИначеЕсли КодСостояния = 507 Тогда // Insufficient Storage
		Расшифровка = НСтр("ru = 'На сервере недостаточно места для выполнения запроса.'");
	ИначеЕсли КодСостояния = 509 Тогда // Bandwidth Limit Exceeded
		Расшифровка = НСтр("ru = 'Сервер превысил отведенное ограничение на потребление трафика.'");
	ИначеЕсли КодСостояния = 510 Тогда // Not Extended
		Расшифровка = НСтр("ru = 'Сервер требует больше информации о совершаемом запросе.'");
	ИначеЕсли КодСостояния = 511 Тогда // Network Authentication Required
		Расшифровка = НСтр("ru = 'Требуется авторизация на сервере.'");
	Иначе 
		Расшифровка = НСтр("ru = '<Неизвестный код состояния>.'");
	КонецЕсли;
	
	Возврат пбп_ПереадресацияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '[%1] %2'"), 
		КодСостояния, 
		Расшифровка);
	
КонецФункции

// Конвертирует запрос с типом Content-Type: multipart/form-data
//
// ВАЖНО! Помимо типа в заголовке "Content-Type" должен быть
// указан разделитель (boundary) частей сообщения, например:
// multipart/form-data; boundary="74d8d09b-8299-44df-b5ec-13e8c4b07219"
//
// Параметры:
//  Запрос					 - HTTPЗапрос	 - запрос, для которого требуется выполнить конвертацию
//  СимволыРазделителя		 - Строка		 - символы разделителя части сообщения
//  ПоместитьФайлыВХранилище - Булево		 - если Истина, то двоичные данные полученных файлов помещаются во временное хранилище
//  СтруктураИстории		 - Структура	 - подробно см. в пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруЗаписиИстории
//  ЗаписатьФайлыВИсторию	 - Булево		 - если Истина, то полученные файлы записываются в структуру истории интеграции.
// Существует два сценария записи файлов запроса в историю:
//  1) Если получен один файл, то он будет записан напрямую в справочник - его имя попадет в реквизит "ИмяФайлаСообщения",
//  а содержимое файла будет помещено в хранилище значений в реквизит "ФайлСообщения";
//  2) Если файл в запросе не один, то все файлы помещаются в zip-архив - имя файла будет равно "Файлы запроса.zip" и
//  попадает в реквизит "ИмяФайлаСообщения", а архив будет помещен в хранилище значений в реквизит "ФайлСообщения".
// 
// Возвращаемое значение:
//  Строка, Структура - текст ошибки или данные запроса. Ключи:
//   - ОбъектЗапроса - данные тела запроса, конвертированные в массив структур из JSON;
//   - ФайлыЗапроса - соответствие из файлов, где ключ - имя файла (с расширением), значение - данные файла
//
Функция КонвертироватьЗапросТипаMultipartFormData(Запрос,
	СимволыРазделителя = "--", ПоместитьФайлыВХранилище = Истина,
	СтруктураИстории = Неопределено, ЗаписатьФайлыВИсторию = Ложь) Экспорт
	
	Попытка
		РезультатЧтения = ПолучитьДанныеОбъектовИзСоставногоЗапроса(Запрос,
			СимволыРазделителя, ПоместитьФайлыВХранилище, СтруктураИстории);
		Если ТипЗнч(РезультатЧтения) = Тип("Строка") Тогда
			Если ЗначениеЗаполнено(СтруктураИстории) Тогда
				СтруктураИстории.ОписаниеОшибки = НСтр(РезультатЧтения);
			КонецЕсли;
			
			Возврат НСтр(РезультатЧтения);
		КонецЕсли;
	Исключение
		ТекстОшибки = СтрШаблон("ru = 'При чтении запроса произошла ошибка. Подробно: %1'",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Если ЗначениеЗаполнено(СтруктураИстории) Тогда
			СтруктураИстории.ОписаниеОшибки = НСтр(ТекстОшибки);
		КонецЕсли;
		
		Возврат НСтр(ТекстОшибки);
	КонецПопытки;
	
	РезультатКонвертации = Новый Структура("ОбъектЗапроса, ФайлыЗапроса", Неопределено, Новый Соответствие);
	
	Если ПустаяСтрока(РезультатЧтения.ТекстСообщения) Тогда
		ТекстОшибки = "ru = 'Тело запроса не содержит JSON-части'";
		Если ЗначениеЗаполнено(СтруктураИстории) Тогда
			СтруктураИстории.ОписаниеОшибки = НСтр(ТекстОшибки);
		КонецЕсли;
		
		Возврат НСтр(ТекстОшибки);
	КонецЕсли;
	
	ПараметрыПреобразования = Новый Структура;
	ПараметрыПреобразования.Вставить("ПрочитатьВСоответствие", Ложь);
	
	РезультатКонвертации.ОбъектЗапроса = пбп_КоннекторHTTP.JsonВОбъект(
		РезультатЧтения.ТекстСообщения, , ПараметрыПреобразования);
	
	РезультатКонвертации.ФайлыЗапроса = пбп_Переадресация.СкопироватьРекурсивно(РезультатЧтения.ФайлыСообщения);
	
	Если ЗначениеЗаполнено(СтруктураИстории) И ЗаписатьФайлыВИсторию Тогда
		ЗаписатьФайлыСоставногоЗапросаВИсториюИнтеграции(РезультатКонвертации.ФайлыЗапроса,
			СтруктураИстории, ПоместитьФайлыВХранилище);
	КонецЕсли;
	
	Возврат РезультатКонвертации;
	
КонецФункции

#КонецОбласти // REST

#Область FTP

// Выполнить подключение к FTP-серверу по настройке интеграции
// См. пбп_ИнтеграцииFTPSFTP.ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока.
//
Функция ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока(ИнтеграционныйПоток) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ВыполнитьПодключениеКFTPСерверуДляИнтеграционногоПотока(ИнтеграционныйПоток);
	
КонецФункции

// Отправить сообщение FTP
// См. пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеFTP.
//
Функция ОтправитьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения);
	
КонецФункции

// Прочитать сообщение FTP
// См. пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеFTP.
//
Функция ПрочитатьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеFTP(ПодключениеКFTP, ПараметрыСообщения);
	
КонецФункции

// Проверяет наличие файла на FTP
// См. пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаFTP.
//
Функция ПроверитьФайлЕстьНаFTP(FTPСоединение, ИмяФайла, КаталогПоиска = "/", ПоТочномуСовпадению = Истина) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаFTP(FTPСоединение, ИмяФайла, КаталогПоиска, ПоТочномуСовпадению);
	
КонецФункции

#КонецОбласти // FTP

#Область SFTP

// Отправляет сообщение на SFTP-сервер.
// См. пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеSFTP.
//
Функция ОтправитьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ОтправитьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории);
	
КонецФункции

// Получает список файлов с каталога SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.ПолучитьСодержимоеКаталогаSFTP.
//
Функция ПолучитьСодержимоеКаталогаSFTP(ИнтеграционныйПоток, КаталогПоиска, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПолучитьСодержимоеКаталогаSFTP(ИнтеграционныйПоток, КаталогПоиска, СтруктураИстории);
	
КонецФункции

// Проверяет наличие файла на SFTP
// См. пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаSFTP.
//
Функция ПроверитьФайлЕстьНаSFTP(ИнтеграционныйПоток,
	ИмяФайла, КаталогПоиска = "/", ПоТочномуСовпадению = Истина, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПроверитьФайлЕстьНаSFTP(ИмяФайла,
		КаталогПоиска, ПоТочномуСовпадению, СтруктураИстории);
	
КонецФункции

// Получает сообщение с SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеSFTP.
//
Функция ПрочитатьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.ПрочитатьСообщениеSFTP(ИнтеграционныйПоток, ПараметрыСообщения, СтруктураИстории);
	
КонецФункции

// Удаляет файл с SFTP-сервера.
// См. пбп_ИнтеграцииFTPSFTP.УдалитьФайлSFTP.
//
Функция УдалитьФайлSFTP(ИнтеграционныйПоток, ИмяФайла,
	КаталогФайла = "/", ПроверитьНаличиеПередУдалением = Истина, СтруктураИстории = Неопределено) Экспорт
	
	Возврат пбп_ИнтеграцииFTPSFTP.УдалитьФайлSFTP(ИнтеграционныйПоток,
		ИмяФайла, КаталогФайла, ПроверитьНаличиеПередУдалением, СтруктураИстории);
	
КонецФункции

#КонецОбласти // SFTP

#Область КоманднаяСтрока

// Выполняет указанную команду системы интеграционного потока
//
// Параметры:
//  ИнтеграционныйПоток			 - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток, хранящий данные команды
//  СтруктураАтрибутов			 - Структура - ключ - наименование атрибута, значение - значение атрибута
//  СимволПараметра				 - Строка - символ инициализации параметра команды (по-умолчанию "/")
//  РазделительПараметраЗначения - Строка - символ разделителя между именем и значением параметра (по-умолчанию " ")
//  ПараметрыЗапускаКоманды		 - Структура - см. пбп_ФайловаяСистема.ПараметрыЗапускаПрограммы
//  СтруктураИстории			 - Структура - см. пбп_ИнтеграцииСлужебный.ПолучитьСтруктуруЗаписиИстории
// 
// Возвращаемое значение:
//  Число, Строка - см. пбп_ФайловаяСистема.ЗапуститьПрограмму
//
Функция ВыполнитьКомандуСистемы(ИнтеграционныйПоток, СтруктураАтрибутов,
	СимволПараметра = "/", РазделительПараметраЗначения = " ",
	ПараметрыЗапускаКоманды = Неопределено, СтруктураИстории = Неопределено) Экспорт
	
	РеквизитыПотока = пбп_Переадресация.ЗначенияРеквизитовОбъекта(
		ИнтеграционныйПоток, "НастройкаИнтеграции.ИнтегрируемаяСистема, НастройкаИнтеграции.СтрокаПодключения, ТочкаВхода");
	
	СтрокаАтрибутов = "";
	
	Для Каждого КлючИЗначение Из СтруктураАтрибутов Цикл
		Разделитель = ?(ПустаяСтрока(СтрокаАтрибутов), СимволПараметра, " " + СимволПараметра);
		СтрокаАтрибутов = СтрокаАтрибутов + Разделитель + КлючИЗначение.Ключ
			+ РазделительПараметраЗначения + """" + КлючИЗначение.Значение + """";
	КонецЦикла;
	
	ИтоговаяКоманда = СтрШаблон("%1 %2 %3", РеквизитыПотока.НастройкаИнтеграцииСтрокаПодключения,
		РеквизитыПотока.ТочкаВхода, СтрокаАтрибутов);
	
	Если ПараметрыЗапускаКоманды = Неопределено Тогда
		ПараметрыЗапускаКоманды = пбп_Переадресация.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаКоманды.ДождатьсяЗавершения = Истина;
	КонецЕсли;
	
	Если СтруктураИстории <> Неопределено Тогда
		НачалоВызова = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// BSLLS:ExternalAppStarting-off
	Результат = пбп_Переадресация.ЗапуститьПрограмму(ИтоговаяКоманда, ПараметрыЗапускаКоманды);
	// BSLLS:ExternalAppStarting-on
	
	Если СтруктураИстории <> Неопределено Тогда
		СтруктураИстории.ДлительностьВызова = ТекущаяДатаСеанса() - НачалоВызова;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // КоманднаяСтрока

#КонецОбласти

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеОбъектовИзСоставногоЗапроса(Запрос,
	СимволыРазделителя, ПоместитьФайлыВХранилище, СтруктураИстории)
	
	Заголовки = КонвертироватьЗаголовкиПоСтандартуRFC(Запрос.Заголовки);
	Тело = Запрос.ПолучитьТелоКакДвоичныеДанные();
	
	РезультатЧтения = ПрочитатьСообщениеСоставногоЗапроса(Заголовки,
		Тело, СимволыРазделителя, ПоместитьФайлыВХранилище);
	
	Если ЗначениеЗаполнено(СтруктураИстории)
		И ТипЗнч(РезультатЧтения) = Тип("Структура") Тогда
		СтруктураИстории.ВходящееСообщение = РезультатЧтения.ТекстСообщения;
	КонецЕсли;
	
	Возврат РезультатЧтения;
	
КонецФункции

Функция КонвертироватьЗаголовкиПоСтандартуRFC(Заголовки)
	
	ЗаголовкиRFC = Новый Соответствие;
	Для Каждого КлючИЗначение Из Заголовки Цикл
		ЗаголовкиRFC.Вставить(НРег(КлючИЗначение.Ключ), КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат ЗаголовкиRFC;
	
КонецФункции

Функция ПрочитатьСообщениеСоставногоЗапроса(Заголовки,
	Тело, СимволыРазделителя, ПоместитьФайлыВХранилище)
	
	Разделитель = ПолучитьРазделительСоставногоЗапроса(Заголовки);
	Если Не ЗначениеЗаполнено(Разделитель) Тогда
		Возврат "ru = 'Разделитель boundary не заполнен в заголовках запроса'";
	КонецЕсли;
	
	Маркеры = Новый Массив;
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки(СимволыРазделителя + Разделитель));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки(СимволыРазделителя + Разделитель + Символы.ПС));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки(СимволыРазделителя + Разделитель + Символы.ВК));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки(СимволыРазделителя + Разделитель + Символы.ВК + Символы.ПС));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки(СимволыРазделителя + Разделитель + СимволыРазделителя));
	
	ТекстСообщения = Неопределено;
	ФайлыСообщения = Новый Соответствие;
	
	ЧтениеДанных = Новый ЧтениеДанных(Тело);
	
	// Перейти к началу первой части.
	ЧтениеДанных.ПропуститьДо(Маркеры);
	
	ОбщийБуферДвоичныхДанных = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
	БуферыДвоичныхДанных = ОбщийБуферДвоичныхДанных.Разделить(Маркеры);
	
	Если Не БуферыДвоичныхДанных.Количество() Тогда
		Возврат "ru = 'Запрос типа multipart/form-data составлен некорректно'";
	КонецЕсли;
	
	// Прочитать в цикле все части тела сообщения.
	Для Каждого Буфер Из БуферыДвоичныхДанных Цикл
		Поток = Новый ПотокВПамяти(Буфер);
		ЧтениеЧасти = Новый ЧтениеДанных(Поток);
		
		ЗаголовкиЧасти = ПрочитатьЗаголовкиСоставногоЗапроса(ЧтениеЧасти);
		ИменаЧасти = ПолучитьИмяСообщенияСоставногоЗапроса(ЗаголовкиЧасти);
		Если Не ЗначениеЗаполнено(ИменаЧасти) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ИменаЧасти.Свойство("name") Тогда
			Продолжить;
		КонецЕсли;
		
		// Если блок не содержит filename, то это содержимое запроса
		Если Не ИменаЧасти.Свойство("filename") Тогда
			ТекстСообщения = ЧтениеЧасти.ПрочитатьСимволы();
		Иначе
			ИмяЧасти = ИменаЧасти.filename;
			
			ФайлыСообщения.Вставить(ИмяЧасти);
			
			ДанныеФайла = ЧтениеЧасти.Прочитать().ПолучитьДвоичныеДанные();
			Если ПоместитьФайлыВХранилище Тогда
				ФайлыСообщения[ИмяЧасти] = ПоместитьВоВременноеХранилище(
					ДанныеФайла,
					Новый УникальныйИдентификатор);
			Иначе
				ФайлыСообщения[ИмяЧасти] = ДанныеФайла;
			КонецЕсли;
		КонецЕсли;
		
		ПерваяИтерация = Ложь;
		
		ЧтениеЧасти.Закрыть();
		Поток.Закрыть();
	КонецЦикла;
	
	ЧтениеДанных.Закрыть();
	
	Возврат Новый Структура("ТекстСообщения, ФайлыСообщения", ТекстСообщения, ФайлыСообщения);
	
КонецФункции

Функция ПолучитьРазделительСоставногоЗапроса(Заголовки)
	
	ТипСодержимого = Заголовки.Получить("content-type");
	Если ТипСодержимого = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Свойства = СтрРазделить(ТипСодержимого, ";", Ложь);
	
	Граница = Неопределено;
	
	Для Каждого Свойство Из Свойства Цикл
		Части = СтрРазделить(Свойство, "=", Ложь);
		ИмяСвойства = СокрЛП(Части[0]);
		
		Если ИмяСвойства = "boundary" Тогда
			Граница = СокрЛП(Части[1]);
			Граница = СтрЗаменить(Граница, """", "");
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Граница;
	
КонецФункции

Функция ПрочитатьЗаголовкиСоставногоЗапроса(Чтение)
	
	Заголовки = Новый Соответствие;
	
	Пока Истина Цикл
		Строка = Чтение.ПрочитатьСтроку();
		
		Если Строка = "" Тогда
			Прервать;
		КонецЕсли;
		
		Части = СтрРазделить(Строка, ":");
		Если Части.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяЗаголовка = СокрЛП(Части[0]);
		Значение = СокрЛП(Части[1]);
		
		Заголовки.Вставить(ИмяЗаголовка, Значение);
	КонецЦикла;
	
	Возврат Заголовки;
	
КонецФункции

Функция ПолучитьИмяСообщенияСоставногоЗапроса(Заголовки)
	
	Описание = Заголовки.Получить("content-disposition");
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Свойства = СтрРазделить(Описание, ";", Ложь);
	
	Имена = Новый Структура;
	Для Каждого Свойство Из Свойства Цикл
		Части = СтрРазделить(Свойство, "=", Ложь);
		
		ИмяСвойства = СокрЛП(Части[0]);
		
		Если Части.Количество() = 2 И (ИмяСвойства = "name" Или ИмяСвойства = "filename") Тогда
			Имя = СокрЛП(Части[1]);
			Имя = СтрЗаменить(Имя, """", "");
			Имена.Вставить(ИмяСвойства, Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Имена;
	
КонецФункции

Процедура ЗаписатьФайлыСоставногоЗапросаВИсториюИнтеграции(ФайлыЗапроса,
	СтруктураИстории, ПоместитьФайлыВХранилище)
	
	КоличествоФайлов = ФайлыЗапроса.Количество();
	Если КоличествоФайлов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоФайлов = 1 Тогда
		Для Каждого КлючИЗначение Из ФайлыЗапроса Цикл
			СтруктураИстории.ИмяФайлаСообщения = КлючИЗначение.Ключ;
			Если ПоместитьФайлыВХранилище Тогда
				ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(КлючИЗначение.Значение);
			Иначе
				ДвоичныеДанныеФайла = КлючИЗначение.Значение;
			КонецЕсли;
			
			СтруктураИстории.ФайлСообщения = Новый ХранилищеЗначения(ДвоичныеДанныеФайла, Новый СжатиеДанных(9));
		КонецЦикла;
	Иначе
		ЗаписатьФайлыСоставногоЗапросаВАрхив(ФайлыЗапроса, СтруктураИстории, ПоместитьФайлыВХранилище);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьФайлыСоставногоЗапросаВАрхив(ФайлыЗапроса, СтруктураИстории, ПоместитьФайлыВХранилище)
	
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ZipФайл = Новый ЗаписьZipФайла(ИмяФайлаАрхива);
	
	МассивИменВременныхФайлов = Новый Массив;
	
	Для Каждого КлючИЗначение Из ФайлыЗапроса Цикл
		ИмяВременногоФайла = ПолучитьИмяВременногоФайлаДляФайлаСоставногоЗапроса(КлючИЗначение.Ключ);
		
		Если ПоместитьФайлыВХранилище Тогда
			ДанныеФайла = ПолучитьИзВременногоХранилища(КлючИЗначение.Значение);
		Иначе
			ДанныеФайла = КлючИЗначение.Значение;
		КонецЕсли;
		
		ДанныеФайла.Записать(ИмяВременногоФайла);
		
		ZipФайл.Добавить(ИмяВременногоФайла);
		МассивИменВременныхФайлов.Добавить(ИмяВременногоФайла);
	КонецЦикла;
	
	ZipФайл.Записать();
	
	СтруктураИстории.ИмяФайлаСообщения = "Файлы запроса.zip";
	
	ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ИмяФайлаАрхива);
	СтруктураИстории.ФайлСообщения = Новый ХранилищеЗначения(ДвоичныеДанныеАрхива, Новый СжатиеДанных(9));
	
	Для Каждого ИмяФайла Из МассивИменВременныхФайлов Цикл
		пбп_Переадресация.УдалитьВременныйФайл(ИмяФайла);
	КонецЦикла;
	
	пбп_Переадресация.УдалитьВременныйФайл(ИмяФайлаАрхива);
	
КонецПроцедуры

Функция ПолучитьИмяВременногоФайлаДляФайлаСоставногоЗапроса(ИмяФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	РазделительПутиОС = ПолучитьРазделительПути();
	МассивРазделителей = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИмяВременногоФайла, РазделительПутиОС);
	
	МассивРазделителей.Удалить(МассивРазделителей.Количество() - 1);
	ИмяВременногоФайла = СтрСоединить(МассивРазделителей, РазделительПутиОС);
	
	Возврат ИмяВременногоФайла + РазделительПутиОС + ИмяФайла;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
